Reports/АК_Сопоставление97Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АК_Сопоставление97Счета</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеБух</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетБух</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаОборотДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаФинансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетФин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаОборотДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаводскойНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РБПСсылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/АК_Сопоставление97Счета/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе бухгалтерии!");
		Возврат;
	КонецПопытки;
	
	//Если НЕ ПодключениеУстановлено Тогда
	//
	//	СтрокаПодключения="Srvr=""10.0.0.15""; Ref=""BP_CORP""; Usr=""Обмен""; Pwd=""123321""";
	//
	//	v82COMОбъект = Новый COMОбъект("v82.COMConnector");
	//	Попытка
	//		v82 = v82COMОбъект.Connect(СтрокаПодключения);
	//		ПодключениеУстановлено=Истина;
	//	Исключение
	//		ПодключениеУстановлено=Ложь;
	//		Сообщить("Не удалось подключиться к базе бухгалтерии!");
	//		Возврат;
	//	КонецПопытки;
	//	
	//КонецЕсли;
	
	Запрос=v82.NewObject("Запрос");
	
	ЗапросДанныеФинансов = Новый Запрос;
	
	Анализ011 = Ложь;
	Анализ109 = Ложь;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="ПериодОтчета" Тогда
			Запрос.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			Запрос.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));
			
			ЗапросДанныеФинансов.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			ЗапросДанныеФинансов.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));
			ЗапросДанныеФинансов.УстановитьПараметр("КонецПериодаОст",КонецДня(Параметр.Значение.ДатаОкончания) + 1);		
		
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаФинансы.Очистить();
	ДанныеБух.Очистить();

	МассивСчетов = Новый Массив;	
	МассивСчетов.Добавить(ПланыСчетов.Финансовый.РасходыНаОплатуТрудаБудущихПериодов);		
	МассивСчетов.Добавить(ПланыСчетов.Финансовый.РасходыБудущихПериодовНаДобровольноеСтрахованиеРаботников);		
	МассивСчетов.Добавить(ПланыСчетов.Финансовый.ПрочиеРасходыБудущихПериодов);
	//
	МассивСчетов.Добавить(ПланыСчетов.Финансовый.ОсновныеСредстваУчетНМА);
	МассивСчетов.Добавить(ПланыСчетов.Финансовый.АмортизацияОсновныхСредствУчетНМА);
		
	ЗапросДанныеФинансов.УстановитьПараметр("Счета", МассивСчетов);
	  
	ЗапросДанныеФинансов.Текст = "ВЫБРАТЬ
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстаткиИОбороты.Счет.Код = ""01.4""
	                             |				ИЛИ ФинансовыйОстаткиИОбороты.Счет.Код = ""02.5""
	                             |			ТОГДА ""01.4-02.5""
	                             |		ИНАЧЕ ФинансовыйОстаткиИОбороты.Счет.Код
	                             |	КОНЕЦ КАК Счет,
	                             |	ФинансовыйОстаткиИОбороты.Субконто1 КАК РБПСсылка,
	                             |	0 КАК ФинСуммаНачало,
	                             |	0 КАК ФинСуммаКонец,
	                             |	ФинансовыйОстаткиИОбороты.Регистратор,
	                             |	ФинансовыйОстаткиИОбороты.СуммаОборотДт КАК ФинСуммаОборотДт,
	                             |	ФинансовыйОстаткиИОбороты.СуммаОборотКт КАК ФинСуммаОборотКт
	                             |ПОМЕСТИТЬ Выборка
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&Счета), , , , ) КАК ФинансовыйОстаткиИОбороты
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""01.4""
	                             |				ИЛИ ФинансовыйОстатки.Счет.Код = ""02.5""
	                             |			ТОГДА ""01.4-02.5""
	                             |		ИНАЧЕ ФинансовыйОстатки.Счет.Код
	                             |	КОНЕЦ,
	                             |	ФинансовыйОстатки.Субконто1,
	                             |	ФинансовыйОстатки.СуммаОстаток,
	                             |	0,
	                             |	NULL,
	                             |	0,
	                             |	0
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Остатки(&Началопериода, Счет В (&Счета), , ) КАК ФинансовыйОстатки
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""01.4""
	                             |				ИЛИ ФинансовыйОстатки.Счет.Код = ""02.5""
	                             |			ТОГДА ""01.4-02.5""
	                             |		ИНАЧЕ ФинансовыйОстатки.Счет.Код
	                             |	КОНЕЦ,
	                             |	ФинансовыйОстатки.Субконто1,
	                             |	0,
	                             |	ФинансовыйОстатки.СуммаОстаток,
	                             |	NULL,
	                             |	0,
	                             |	0
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Остатки(&КонецПериодаОст, Счет В (&Счета), , ) КАК ФинансовыйОстатки
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	Выборка.Счет КАК СчетФин,
	                             |	Выборка.РБПСсылка КАК РБПСсылка,
	                             |	Выборка.Регистратор,
	                             |	СУММА(Выборка.ФинСуммаНачало) КАК ФинСуммаНачало,
	                             |	СУММА(Выборка.ФинСуммаОборотДт) КАК ФинСуммаОборотДт,
	                             |	СУММА(Выборка.ФинСуммаОборотКт) КАК ФинСуммаОборотКт,
	                             |	СУММА(Выборка.ФинСуммаКонец) КАК ФинСуммаКонец,
	                             |	Выборка.РБПСсылка.Наименование КАК Наименование,
	                             |	Выборка.РБПСсылка.ДатаНачалаСписания КАК ДатаНачалаСписания,
	                             |	Выборка.РБПСсылка.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	                             |	Выборка.РБПСсылка.Сумма КАК Сумма,
	                             |	Выборка.РБПСсылка.Код КАК Код,
	                             |	ВЫБОР
	                             |		КОГДА Выборка.РБПСсылка ССЫЛКА Справочник.ОсновныеСредства
	                             |			ТОГДА Выборка.РБПСсылка.ЗаводскойНомер
	                             |		ИНАЧЕ """"
	                             |	КОНЕЦ КАК ЗаводскойНомер
	                             |ИЗ
	                             |	Выборка КАК Выборка
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	Выборка.Счет,
	                             |	Выборка.РБПСсылка,
	                             |	Выборка.Регистратор,
	                             |	Выборка.РБПСсылка.Наименование,
	                             |	Выборка.РБПСсылка.ДатаНачалаСписания,
	                             |	Выборка.РБПСсылка.ДатаОкончанияСписания,
	                             |	Выборка.РБПСсылка.Сумма,
	                             |	Выборка.РБПСсылка.Код,
	                             |	ВЫБОР
	                             |		КОГДА Выборка.РБПСсылка ССЫЛКА Справочник.ОсновныеСредства
	                             |			ТОГДА Выборка.РБПСсылка.ЗаводскойНомер
	                             |		ИНАЧЕ """"
	                             |	КОНЕЦ";
								 	
	ТаблицаФинансы.Загрузить(ЗапросДанныеФинансов.Выполнить().Выгрузить());	
	
	Для Каждого Стр Из ТаблицаФинансы Цикл
		Стр.Код = СокрЛП(Стр.Код);
	КонецЦикла;
	
	ТекстЗапроса="ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет.Код = ""04.01""
				|				ИЛИ ХозрасчетныйОстаткиИОбороты.Счет.Код = ""05""
				|			ТОГДА ""04.01-05""
				|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Счет.Код
				|	КОНЕЦ КАК Счет,
				|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК РБП,
				|	ХозрасчетныйОстаткиИОбороты.Субконто1.Код КАК КодРБП,
				|	0 КАК БухСуммаНачало,
				|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК БухСуммаОборотДт,
				|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК БухСуммаОборотКт,
				|	0 КАК БухСуммаКонец
				|ПОМЕСТИТЬ Выборка
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&Счета), , , , ) КАК ХозрасчетныйОстаткиИОбороты

				|ОБЪЕДИНИТЬ ВСЕ

				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""04.01""
				|				ИЛИ ХозрасчетныйОстатки.Счет.Код = ""05""
				|			ТОГДА ""04.01-05""
				|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Код
				|	КОНЕЦ,
				|	ХозрасчетныйОстатки.Субконто1,
				|	ХозрасчетныйОстатки.Субконто1.Код,
				|	ХозрасчетныйОстатки.СуммаОстаток,
				|	0,
				|	0,
				|	0
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В (&Счета), , ) КАК ХозрасчетныйОстатки

				|ОБЪЕДИНИТЬ ВСЕ

				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ХозрасчетныйОстатки.Счет.Код = ""04.01""
				|				ИЛИ ХозрасчетныйОстатки.Счет.Код = ""05""
				|			ТОГДА ""04.01-05""
				|		ИНАЧЕ ХозрасчетныйОстатки.Счет.Код
				|	КОНЕЦ,
				|	ХозрасчетныйОстатки.Субконто1,
				|	ХозрасчетныйОстатки.Субконто1.Код,
				|	0,
				|	0,
				|	0,
				|	ХозрасчетныйОстатки.СуммаОстаток
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1), Счет В (&Счета), , ) КАК ХозрасчетныйОстатки
				|;

				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Выборка.Счет КАК СчетБух,
				|	Выборка.РБП КАК РБПСсылка,
				|	Выборка.РБП.Наименование КАК Наименование,
				|	Выборка.КодРБП КАК Код,
				|	СУММА(Выборка.БухСуммаНачало) КАК БухСуммаНачало,
				|	СУММА(Выборка.БухСуммаКонец) КАК БухСуммаКонец,
				|	СУММА(Выборка.БухСуммаОборотДт) КАК БухСуммаОборотДт,
				|	СУММА(Выборка.БухСуммаОборотКт) КАК БухСуммаОборотКт,
				|	Выборка.РБП.ДатаНачалаСписания КАК ДатаНачалаСписания,
				|	Выборка.РБП.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
				|	Выборка.РБП.Сумма КАК Сумма
				|ИЗ
				|	Выборка КАК Выборка

				|СГРУППИРОВАТЬ ПО
				|	Выборка.Счет,
				|	Выборка.РБП,
				|	Выборка.КодРБП,
				|	Выборка.РБП.Наименование,
				|	Выборка.РБП.ДатаНачалаСписания,
				|	Выборка.РБП.ДатаОкончанияСписания,
				|	Выборка.РБП.Сумма";
	
	Запрос.Текст=ТекстЗапроса;
	
	МассивСчетов=v82.NewObject("Массив");
	МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
	МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.РасходыБудущихПериодовНаДобровольноеСтрахованиеРаботников);
	МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.ПрочиеРасходыБудущихПериодов);
	//
	МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.НематериальныеАктивыОрганизации);
	МассивСчетов.Добавить(v82.ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
					
	Запрос.УстановитьПараметр("Счета",МассивСчетов);
	
	Выборка=Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		НС=ДанныеБух.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);		
		
		НС.Код = СокрЛП(Выборка.Код);
		НС.Обработан = Ложь;
		
	КонецЦикла;	
		
	СводнаяТаблица = Новый ТаблицаЗначений;	
	СводнаяТаблица.Колонки.Добавить("РБП");
	СводнаяТаблица.Колонки.Добавить("РБПКод");
	СводнаяТаблица.Колонки.Добавить("Регистратор");
	СводнаяТаблица.Колонки.Добавить("СчетФин");
	СводнаяТаблица.Колонки.Добавить("СчетБух");
	СводнаяТаблица.Колонки.Добавить("БухСуммаНачало");
	СводнаяТаблица.Колонки.Добавить("БухСуммаКонец");	
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотДт");	
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотКт");	
	//
	СводнаяТаблица.Колонки.Добавить("ФинСуммаНачало");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаКонец");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотДт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотКт");
	
	НайдСтр = Неопределено;
	
	ТЗСоот = Новый ТаблицаЗначений;
	ТЗСоот.Колонки.Добавить("РБПСсылка");
	ТЗСоот.Колонки.Добавить("НайдСтр");
	
	Для Каждого Стр Из ТаблицаФинансы Цикл		
				
		НовСтр = СводнаяТаблица.Добавить();
		
		НовСтр.БухСуммаНачало = 0;
		НовСтр.БухСуммаКонец = 0;
		НовСтр.БухСуммаОборотДт = 0;
		НовСтр.БухСуммаОборотКт = 0;
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.РБП = Стр.Наименование;
		НовСтр.РБПКод = Стр.Код;
		
		Если Стр.СчетФин = "01.4-02.5" Тогда
			НовСтр.СчетФин = Стр.СчетФин;
			НовСтр.СчетБух = "04.01-05";		
		Иначе
			НовСтр.СчетФин = Стр.СчетФин;
			НовСтр.СчетБух = Стр.СчетФин;
		КонецЕсли;
		
		Если Стр.СчетФин = "01.4-02.5" Тогда
			
			НовСтр.РБПКод = СокрЛП(Стр.ЗаводскойНомер);
			
			//поиск РБП из бух		
			НайдСтр = Неопределено;	
		
			СтруктураПоиска = Новый Структура;
			
			Если Стр.СчетФин = "01.4-02.5" Тогда
				СтруктураПоиска.Вставить("СчетБух", "04.01-05");
			КонецЕсли;
			
			СтруктураПоиска.Вставить("Код", СокрЛП(Стр.ЗаводскойНомер));
			СтруктураПоиска.Вставить("Обработан", Ложь);
			
			//Сообщить("Поиск: " + Стр.Наименование + ", Счет: " + СтруктураПоиска["Счет"] + ", Код " + СокрЛП(Стр.ЗаводскойНомер));
			
		Иначе		
		
			//поиск РБП из бух		
			НайдСтр = Неопределено;	
		
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("СчетБух", Стр.СчетФин);
			СтруктураПоиска.Вставить("Код", Стр.Код);
			СтруктураПоиска.Вставить("Обработан", Ложь);
			
		КонецЕсли;
				
		НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
		Если НайдСтроки.Количество() Тогда
		 	НайдСтр = НайдСтроки[0];
		Иначе
			СтруктураПоиска.Удалить("СчетБух");
			НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
			
			Если НайдСтроки.Количество() Тогда
				НайдСтр = НайдСтроки[0];
				
			Иначе
				
				СтруктураПоиска.Вставить("Код", Стр.Код);
				
			    НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
			
				Если НайдСтроки.Количество() Тогда
					НайдСтр = НайдСтроки[0];
				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;
		
		ПолученоИзТаблицы = Ложь;
		
		Если НайдСтр <> Неопределено Тогда
			
			НовСтрСоот = ТЗСоот.Добавить();
			НовСтрСоот.РБПСсылка = Стр.РБПСсылка;
			НовСтрСоот.НайдСтр = НайдСтр;
			
		КонецЕсли;
		
		Если НайдСтр = Неопределено Тогда
			тмпСтр = ТзСоот.Найти(Стр.РБПСсылка, "РБПСсылка");
			
			Если тмпСтр <> Неопределено Тогда
				НайдСтр = тмпСтр.НайдСтр;
				ПолученоИзТаблицы = Истина;
			КонецЕсли;
		КонецЕсли;
				
		Если НайдСтр <> Неопределено Тогда	
			
			//Если НЕ НайдСтр.Обработан Тогда
			
			//Сообщить("ПОлучено из таблицы " + Строка(полученоИзТаблицы) + " - " + Строка(найдСтр));
			
				НовСтр.СчетБух = НайдСтр.СчетБух;
				
				Если НЕ ПолученоИзТаблицы Тогда
					НовСтр.БухСуммаНачало = НайдСтр.БухСуммаНачало;
					НовСтр.БухСуммаКонец = НайдСтр.БухСуммаКонец;
					НовСтр.БухСуммаОборотДт = НайдСтр.БухСуммаОборотДт;
					НовСтр.БухСуммаОборотКт = НайдСтр.БухСуммаОборотКт;
				Иначе
					НовСтр.БухСуммаНачало = 0;
					НовСтр.БухСуммаКонец = 0;
					НовСтр.БухСуммаОборотДт = 0;
					НовСтр.БухСуммаОборотКт = 0;
				КонецЕсли;
				
				//ЗаполнитьЗначенияСвойств(НовСтр, НайдСтр);
				
				НОвСтр.РБП = Стр.Наименование;
				
				Если Стр.СчетФин = "01.4-02.5" Тогда
					НовСтр.РБПКод = Стр.ЗаводскойНомер;
				Иначе
					НовСтр.РБПКод = Стр.Код;
				КонецЕсли;
				
				НайдСтр.Обработан = Истина;
				
			//КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если НЕ Стр.Обработан Тогда
			НовСтр = СводнаяТаблица.Добавить();
			ЗаполнитьЗначениясвойств(НовСтр, Стр);
			НОвСтр.РБП = Стр.Наименование;
			НОвСтр.РБПКод = Стр.Код;
			//
			НовСтр.СчетФин = Стр.СчетБух;
			НовСтр.ФинСуммаНачало = 0;
			НовСтр.ФинСуммаКонец = 0;
			НовСтр.ФинСуммаОборотДт = 0;
			НовСтр.ФинСуммаОборотКт = 0;			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	МассивСтрДляУд = Новый Массив;
	
	Для Каждого Стр Из СводнаяТаблица Цикл
		
		Если Найти(Стр.Рбп, "ТЗ ""Избенка") Тогда
			МассивСтрДляУд.Добавить(Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрУд Из МассивСтрДляУд Цикл
		СводнаяТаблица.Удалить(СтрУд);
	КонецЦикла;
		
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
											Настройки, ДанныеРасшифровки);

	ВнешниеНаборыДанных=Новый Структура;

	ВнешниеНаборыДанных.Вставить("СводнаяТаблица",СводнаяТаблица);										
											
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
													   ДанныеРасшифровки);

	//Очищаем поле табличного документа

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
